performance/tests/order.yml
execution:
  - concurrency: 1
    hold-for: 2m
    scenario: get-orders
  - concurrency: 1
    hold-for: 2m
    scenario: get-order
  - concurrency: 1
    hold-for: 2m
    scenario: search-orders
  - concurrency: 1
    hold-for: 2m
    scenario: get-requesting-facilities
  - concurrency: 1
    hold-for: 2m
    scenario: print-order-pdf
  - concurrency: 1
    hold-for: 2m
    scenario: print-order-csv
  - concurrency: 1
    hold-for: 2m
    scenario: export-order-csv

scenarios:
  get-user-token:
    requests:
      - url: ${__P(base-uri)}/api/oauth/token
        method: POST
        label: GetUserToken
        headers:
          Authorization: Basic ${__base64Encode(${__P(user-auth)})}
        body:
          grant_type: password
          username: ${__P(username)}
          password: ${__P(password)}
        extract-jsonpath:
          access_token:
            jsonpath: $.access_token
  get-orders:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders
        method: GET
        label: GetAllOrders
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-order:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}
        method: GET
        label: GetOrder
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  search-orders:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/search?supplyingFacilityId=${__P(supplying_facility_id)}
        method: GET
        label: FindOrdersBySupplyingFacility
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  get-requesting-facilities:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/requestingFacilities?supplyingFacilityId=${__P(supplying_facility_id)}
        method: GET
        label: GetRequestingFacilities
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-order-pdf:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}/print?format=pdf
        method: GET
        label: PrintOrderAsPdf
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  print-order-csv:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}/print?format=csv
        method: GET
        label: PrintOrderAsCsv
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
  export-order-csv:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/orders/${__P(order_id)}/export?type=csv
        method: GET
        label: ExportOrderAsCsv
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json